Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: to see how the current time has been baked into the binary. This time was calculated when the binary was being built, hence application restarts have no effect.
ja_jp: 現在の時刻がどのようにバイナリに焼き付けられているかを確認できます。この時刻は、バイナリのビルド時に計算されたものなので、アプリケーションの再起動が影響しません。

source: to set `auto.offset.reset = earliest`
ja_jp: `auto.offset.reset = earliest` の設定

source: to your application's pom then you will see a Swagger link in OIDC Dev UI:
ja_jp: OIDC Dev UI に Swagger リンクが表示されます。

source: tooling: Anything that can be added to improve the project (e.g. Dockerfiles, GitHub Actions workflows)
ja_jp: tooling:プロジェクトを改善するために追加できるもの（例: Dockerfiles、GitHub Actions など）

source: tooling: Anything that can be added to improve the project (e.g. dockerfiles, github-action)
ja_jp: tooling:プロジェクトを改善するために追加できるもの（例：dockerfiles、github-actionなど）

source: top-k - `.topk()` (requires the https://redis.com/modules/redis-bloom/[RedisBloom] module on the server side, which also provides the top-k filter commands)
ja_jp: top-k - `.topk()` (サーバー側に link:https://redis.com/modules/redis-bloom/[RedisBloom] モジュールが必要で、top-kフィルターコマンドも提供します)

source: transaction
ja_jp: トランザクション

source: transaction demarcation cannot be done using `jakarta.transaction.Transactional`
ja_jp: `jakarta.transaction.Transactional` を使用して、トランザクション境界を行うことはできません。

source: transaction demarcation cannot be done using `javax.transaction.Transactional`
ja_jp: `javax.transaction.Transactional` を使用して、トランザクション境界を行うことはできません。

source: type: the type (example text/plain)
ja_jp: type: タイプ (例: text/plain)

source: underscore, or
ja_jp: アンダースコア、または

source: unless you're using in-memory or file databases (such as H2 or SQLite), you need to add a flyway module dependency corresponding to the database you're using. (https://github.com/flyway/flyway/issues/3780[for more details])
ja_jp: (H2やSQLiteのような)インメモリデータベースやファイルデータベースを使用していない限り、使用しているデータベースに対応するflywayモジュールの依存関係を追加する必要があります。( 詳細は link:https://github.com/flyway/flyway/issues/3780[こちら] )

source: updateWhenLocaleChanges: tells Lit to re-render automatically when language changes
ja_jp: updateWhenLocaleChanges: 言語変更時に Lit に自動的に再レンダリングするように指示

source: upx is cross-platform.
ja_jp: upxはクロスプラットフォームです。

source: use the `throttled` policy,
ja_jp: `throttled` ポリシーの使用

source: user name is anonymous
ja_jp: ユーザー名は anonymous (匿名) です。

source: user task
ja_jp: ユーザータスク

source: username is anonymous
ja_jp: ユーザー名は匿名です

source: uses the shorthand `@RestForm` annotation to make a field as a part of a multipart form
ja_jp: 省略形の `@RestForm` アノテーションを使用して、マルチパートフォームの一部としてフィールドを作成します

source: validate extension metadata configuration;
ja_jp: エクステンションメタデータ設定を検証します。

source: validating the input/output of your REST services;
ja_jp: REST サービスの入出力の検証

source: validating the parameters and return values of the methods of your business services.
ja_jp: ビジネスサービスのメソッドのパラメーターと戻り値の検証

source: value
ja_jp: 値

source: version compatibility between the dependencies;
ja_jp: 依存関係間のバージョン互換性;

source: view `Dev Services` information
ja_jp: `Dev Services` の情報の表示

source: view and change `Configuration`
ja_jp: `Configuration` の表示と変更

source: view and stream various logs
ja_jp: 各種ログの表示とストリーミング

source: view and stream various logs.
ja_jp: 様々なログを表示、ストリーミング

source: view extension statuses and go directly to extension documentation
ja_jp: エクステンションのステータス表示とドキュメントへの直接移動

source: view the Build information
ja_jp: ビルド情報の表示

source: we have enough profiling data to perform meaningful optimizations.
ja_jp: 意味のある最適化を行うための十分なプロファイリングデータがあります。

source: we may introduce other layout types in the future.
ja_jp: 将来的には他のレイアウトタイプを導入する可能性があります。

source: we provide convenience class to deserialize common Google Cloud event inside the `io.quarkus.funqy.gcp.functions.event` package. They are not mandatory to use, you can use any object you want.
ja_jp: `io.quarkus.funqy.gcp.functions.event` パッケージ内の Google Cloud の共通イベントをデシリアライズするための便利なクラスを提供しています。これらのクラスは必須ではなく、任意のオブジェクトを使用することができます。

source: we provide convenience class to deserialize common Google Cloud events inside the `io.quarkus.funqy.gcp.functions.event` package. They are not mandatory to use, you can use any object you want.
ja_jp: `io.quarkus.funqy.gcp.functions.event` パッケージ内で Google Cloud の共通イベントをデシリアライズするための便利なクラスを提供しています。これらのクラスは必須ではなく、任意のオブジェクトを使用することができます。

source: what was described above is essentially the link:https://www.martinfowler.com/eaaCatalog/activeRecord.html[active record pattern], sometimes just called the entity pattern. Hibernate with Panache also allows for the use of the more classical link:https://martinfowler.com/eaaCatalog/repository.html[repository pattern] via `PanacheRepository`.
ja_jp: 上記で説明したものは、基本的には link:https://www.martinfowler.com/eaaCatalog/activeRecord.html[アクティブレコードパターン] であり、エンティティーパターンと呼ばれることもあります。Hibernate with Panache は、 `PanacheRepository` を通じて、より古典的な link:https://martinfowler.com/eaaCatalog/repository.html[リポジトリパターン] を使用することもできます。

source: what was described above is essentially the link:https://www.martinfowler.com/eaaCatalog/activeRecord.html[active record pattern], sometimes just called the entity pattern. MongoDB with Panache also allows for the use of the more classical link:https://martinfowler.com/eaaCatalog/repository.html[repository pattern] via `PanacheMongoRepository`.
ja_jp: 上で説明したものは基本的に link:https://www.martinfowler.com/eaaCatalog/activeRecord.html[アクティブレコードパターン]で、単にエンティティパターンと呼ばれることもあります。MongoDB with Panacheでは、 `PanacheMongoRepository` を通じて、より古典的な link:https://martinfowler.com/eaaCatalog/repository.html[リポジトリパターン]を使うこともできます。

source: when `getFromMethod` is called, in addition to the `my-param` query parameter, `param-from-method` with the value of `test` (because that's what the `withParam` method returns when invoked with `param-from-method`) will also be added.
ja_jp: `getFromMethod` を呼び出すと、 `my-param` のクエリーパラメーターに加えて、 `param-from-method` に `test` の値 ( `withParam` のメソッドが `param-from-method` と呼び出されたときに返すため) が追加されます。

source: when a virtual thread calls native code (via JNI or the Foreign Function & Memory API) and that native code calls back to Java code that performs a blocking operation
ja_jp: 仮想スレッドがネイティブコードを呼び出し (JNI または Foreign Function & Memory API 経由)、そのネイティブコードがブロッキング操作を実行する Java コードを呼び出す場合

source: when a virtual thread performs a blocking operation inside a `synchronized` block or method
ja_jp: 仮想スレッドが `synchronized` ブロックまたはメソッドの内部でブロッキング操作を実行する場合

source: when it executes a blocking operation inside a native method or a foreign function
ja_jp: ネイティブメソッドや外部関数内でブロッキング操作を実行した場合

source: when using a classpath volume, the container will only be granted read permission. On the other hand, when using a filesystem volume, the container will be granted read and write permission.
ja_jp: クラスパス・ボリュームを使用する場合、コンテナには読み取り権限のみが付与されます。一方、ファイルシステムボリュームを使用する場合、コンテナには読み取りと書き込みの権限が付与されます。

source: when we get the response, extract the body and send it to the user
ja_jp: レスポンスを取得したら、ボディを抽出してユーザーに送信します。

source: when you have relatively complex settings requiring the full flexibility of the configuration
ja_jp: 比較的複雑な設定をしていて、設定の柔軟性が必要な場合

source: where ${java.version} is {jdk-version-all}.
ja_jp: ここで ${java.version} は {jdk-version-all} です。

source: where `<UPPERCASED_AND_UNDERSCORED_REGISTRY_ID>` is a registry ID with each character converted to uppercase and a `.` replaced with `_`. For example, `REGISTRY_ACME_ORG`.
ja_jp: ここで、`<UPPERCASED_AND_UNDERSCORED_REGISTRY_ID>` は、各文字が大文字に変換され、`．` が `_` に置き換えられたレジストリー ID です。例えば、`REGISTRY_ACME_ORG` となります。

source: where `<extensionArtifactId>` is taken from the `<artifactId>` of your extension’s runtime module.
ja_jp: ここで、`<extensionArtifactId>` は、エクステンションのランタイムモジュールの `<artifactId>` から取得されます。

source: where `ProtectedResource` class may look like this:
ja_jp: ここで、 `ProtectedResource` クラスは次のようになります。

source: where `RestClientWithOidcClientFilter` will depend on `OidcClientRequestReactiveFilter` to acquire and propagate the tokens and
ja_jp: `RestClientWithOidcClientFilter` では、 `OidcClientRequestReactiveFilter` に依存して、トークンを獲得し、伝播させ、

source: where `RestClientWithTokenPropagationFilter` will depend on `AccessTokenRequestReactiveFilter` to propagate the incoming, already existing tokens.
ja_jp: `RestClientWithTokenPropagationFilter` では `AccessTokenRequestReactiveFilter` に依存して、着信した、すでに存在するトークンを伝播させることになります。

source: where `SupportUnquotedFields` is a `BiFunction` defined as so:
ja_jp: ここで、 `SupportUnquotedFields` は次のように定義された `BiFunction` です。

source: where `UnquotedFields` is a `BiFunction` defined as so:
ja_jp: ここで、 `UnquotedFields` は次のように定義された `BiFunction` です。

source: where `X-ORIGINAL-HOST` is set by Kubernetes Ingress to represent the external endpoint address.
ja_jp: ここで、 `X-ORIGINAL-HOST` は、外部エンドポイントアドレスを表すために Kubernetes Ingress によって設定されます。

source: where `keycloak.version` is set to `26.0.7` or higher.
ja_jp: ここで、`keycloak.version` は `26.0.7` 以降に設定されます。

source: where `keycloak.version` is set to `26.1.3` or later.
ja_jp: ここで、 `keycloak.version` は `26.1.3` 以降に設定されています。

source: where `keycloak.version` should be set to `17.0.0` or higher.
ja_jp: ここで、 `keycloak.version` は `17.0.0` 以上に設定する必要があります。

source: where `myapp.java` for example is the following:
ja_jp: ここで、例えば `myapp.java` は以下のようになります:

source: where `service.username` and `service.password` are configuration properties that must be set at runtime to the username and password that allow access to the service being called.
ja_jp: ここで、 `service.username` と `service.password` は、実行時にユーザー名とパスワードを設定して呼び出されるサービスへのアクセスを許可する設定プロパティーです。

source: where an implementation of the `KieRuntimeBuilder` interface is automatically generated and made injectable for you by the Drools extension and allows to obtain with a single statement an instance of any KieBases and KieSessions defined in your Drools project.
ja_jp: ここで、 `KieRuntimeBuilder` インターフェイスの実装は Drools エクステンションによって自動的に生成され、挿入可能になり、Drools プロジェクトで定義された任意の KieBases および KieSessions のインスタンスを 1 つのステートメントで取得できるようになります。

source: where both `private.key.from.vault` and `public.key.from.vault` are the `PEM` or `JWK` formatted key values provided by the custom `ConfigSource`. `smallrye.jwt.sign.key` and `smallrye.jwt.encrypt.key` can also contain only the Base64-encoded private or public keys values.
ja_jp: この場合、 `private.key.from.vault` と `public.key.from.vault` はどちらも、カスタムの `ConfigSource` によって提供される `PEM` または `JWK` 形式のキー値です。 `smallrye.jwt.sign.key` と `smallrye.jwt.encrypt.key` には、Base64 でエンコードされた秘密鍵または公開鍵の値のみ含めることができます。

source: where the `ProtectedResource` class might look like this:
ja_jp: ここで、 `ProtectedResource` クラスは次のようになります。

source: whereas providing the LRA context header will work:
ja_jp: 一方、LRAのコンテキストヘッダを提供するとうまくいきます。

source: which additional flags will Quarkus apply to native-image by default
ja_jp: Quarkusがデフォルトでネイティブイメージに適用する追加フラグ

source: which configures our REST client to connect to an SSL REST service.
ja_jp: これは、REST クライアントが SSL REST サービスに接続するように設定しています。

source: which essentially makes Quarkus ignore the `ExceptionMapper` for `MismatchedInputException` completely.
ja_jp: これにより、Quarkus は基本的に `MismatchedInputException` の `ExceptionMapper` を完全に無視するようになります。

source: which generates the following in the `env` section of your container:
ja_jp: これにより、コンテナの `env` セクションに次の内容が生成されます。

source: which generates the following in the container definition:
ja_jp: これはコンテナ定義に以下を生成します：

source: which is all what is needed for the OIDC `service` application to fetch Auth0 public verification keys and use them to verify Auth0 access tokens in JWT format.
ja_jp: これだけで、OIDC `service` アプリケーションは Auth0 公開検証キーを取得し、それを使用して JWT フォーマットの Auth0 アクセストークンを検証できます。

source: which is an equivalent of the `io.quarkus:quarkus-bom` that does not include any of the other platform members, such as Camel, Kogito, OptaPlanner, etc.
ja_jp: これは、Camel、Kogito、OptaPlannerなどの他のプラットフォームのメンバーを含まない `io.quarkus:quarkus-bom` と同等のものです。

source: which pool tuning configuration properties are available
ja_jp: どのプールチューニング設定プロパティーを使用できるか

source: which provides `io.quarkus.test.kafka.KafkaCompanionResource` - an implementation of `io.quarkus.test.common.QuarkusTestResourceLifecycleManager`.
ja_jp: これは、 `io.quarkus.test.kafka.KafkaCompanionResource` (`io.quarkus.test.common.QuarkusTestResourceLifecycleManager` の実装) を提供します。

source: which provides `io.quarkus.test.keycloak.server.KeycloakTestResourceLifecycleManager` - an implementation of `io.quarkus.test.common.QuarkusTestResourceLifecycleManager` which starts a Keycloak container.
ja_jp: これは、Keycloak コンテナーを開始する `io.quarkus.test.common.QuarkusTestResourceLifecycleManager` の実装である `io.quarkus.test.keycloak.server.KeycloakTestResourceLifecycleManager` を提供します。

source: which provides a utility class `io.quarkus.test.keycloak.client.KeycloakTestClient` you can use in tests for acquiring the access tokens.
ja_jp: これは、アクセストークンを取得するためのテストで使用できるユーティリティークラス `io.quarkus.test.keycloak.client.KeycloakTestClient` を提供します。

source: which provides a utility class `io.quarkus.test.oidc.client.OidcTestClient` which can be used in tests for acquiring access tokens (This dependency also offers an OIDC WireMock support - review the documentation how to use it for testing if you want).
ja_jp: これは、アクセストークンの取得テストに使用できるユーティリティークラス `io.quarkus.test.oidc.client.OidcTestClient` を提供します (この依存関係は OIDC WireMock サポートも提供しますので、必要に応じてドキュメントでテストに使用する方法を確認してください)。

source: which will start a PostgreSQL Dev Service container, and open http://localhost:8080 in your browser.
ja_jp: これで、PostgreSQL Dev Service コンテナが起動します。ブラウザで http://localhost:8080 を開いてください。

source: which would generate the following in the container definition:
ja_jp: とすると、コンテナーの定義に以下のようなものが生成されます。

source: whose instance can be easily produced through a <<bytecode-recording,recorder>>,
ja_jp: <<bytecode-recording,recorder>> を通じて簡単にインスタンスを生成できる Bean

source: why does this code path get included in the native binary?
ja_jp: なぜこのコードパスがネイティブ・バイナリに含まれているのか？

source: will also return `200` status code and the name `admin`, as `admin` has both `user` and `admin` roles.
ja_jp: `admin` には `user` ロールと `admin` ロールの両方があるため、 `200` ステータスコードと名前 `admin` を返します。

source: will create a new Quarkus project with a non-platform https://github.com/quarkiverse/quarkus-prettytime[Quarkus Pretty Time extension].
ja_jp: 非プラットフォームの link:https://github.com/quarkiverse/quarkus-prettytime[Quarkus Pretty Timeエクステンション]を持つ新しいQuarkusプロジェクトが作成されます。

source: will ensure that the certificates of `/tmp/mycerts` are baked into the native binary and used *in addition* to the default cacerts. The file containing the custom TrustStore does *not* (and probably should not) have to be present at runtime as its content has been baked into the native binary.
ja_jp: 上記は `/tmp/mycerts` の証明書がネイティブバイナリーに焼き込まれ、デフォルトの cacerts に *加えて* 使用されることを保証します。

source: will ensure that the certificates of `/tmp/mycerts` are baked into the native binary and used *instead* of the default `cacerts`. The file containing the custom TrustStore does *not* (and probably should not) have to be present at runtime as its content has been baked into the native binary.
ja_jp: 上記は `/tmp/mycerts` の証明書がネイティブバイナリーに焼き込まれ、デフォルトの cacerts に *追加で* 使用されることを保証します。カスタム TrustStore を含むファイルはその内容がネイティブバイナリに焼きこまれているので、実行時に存在する必要は *ありません* (そしておそらく存在すべきではありません)。

source: will generate this OpenAPI schema:
ja_jp: これにより、このOpenAPIスキーマが生成されます:

source: will include:
ja_jp: 以下が含まれます。

source: will result in a `java.util.NoSuchElementException: SRCFG02004: Required property greeting.message not found` on startup and the default value will not be assigned.
ja_jp: 起動時に `java.util.NoSuchElementException: SRCFG02004: Required property greeting.message not found` が発生し、デフォルト値は割り当てられません。

source: will return `200` status code and the name `admin`, and
ja_jp: ステータスコード `200` と名前 `alice` を返します。

source: will return `200` status code and the name `alice` while
ja_jp: ステータスコード `200` と名前 `alice` を返します。

source: will return `200` status code and the name `alice`, but
ja_jp: ステータスコード `200` と名前 `alice` を返します

source: will return `403` - recall that `alice` only has a `user` role.
ja_jp: `403` を返します - `alice` には `user` ロールしかないことを思い出してください。

source: will return `403` status code.
ja_jp: ステータスコード `403` を返します。

source: with
ja_jp: 以下に置き換えます。

source: with MCF you don't need dedicated columns to store the hashing algorithm, the iterations count or the salt because they're all stored in the hashed value.
ja_jp: MCF を使うと、ハッシュアルゴリズムや反復回数、 ソルトを格納するための専用のカラムは必要ありません。

source: with `-DgroupId=io.quarkiverse.[extensionId]`, it will use the 'Quarkiverse' extension layout and defaults.
ja_jp: `-DgroupId=io.quarkiverse.[extensionId]` を使用すると、'Quarkiverse' エクステンションのレイアウトとデフォルトを使用します。

source: wrap it like this:
ja_jp: このようにラップして下さい:

source: xDS must be explicitly enabled on the server, then verify you use it on the right xDS server port (default is 9000). If you want to use `XdsServerCredentials` set `xds.secure` to `true`.
ja_jp: xDSはサーバー上で明示的に有効にする必要があり、その後、正しいxDSサーバーポート（デフォルトは9000）でそれを使用することを確認します。もし、 `XdsServerCredentials` を使用したい場合は、 `xds.secure` を `true` にセットしてください。

source: xref:#dev-services[Dev Services for MongoDB] is your best option to start a MongoDB database for your unit tests.
ja_jp: xref:#dev-services[Dev Services for MongoDB] は、ユニットテスト用のMongoDBデータベースを起動するための最適なオプションです。

source: xref:./grpc-virtual-threads.adoc[@RunOnVirtualThread in gRPC services]
ja_jp: xref:./grpc-virtual-threads.adoc[gRPCサービスの@RunOnVirtualThread]

source: xref:./grpc-virtual-threads.adoc[Virtual threads in gRPC services]
ja_jp: xref:./grpc-virtual-threads.adoc[gRPCサービスの仮想スレッド]

source: xref:./messaging-virtual-threads.adoc[@RunOnVirtualThread in messaging applications] (this guide covers Apache Kafka)
ja_jp: xref:./messaging-virtual-threads.adoc[メッセージングアプリケーションにおける @RunOnVirtualThread] (このガイドでは Apache Kafka を扱います)

source: xref:./messaging-virtual-threads.adoc[Virtual threads in reactive messaging applications]
ja_jp: xref:./messaging-virtual-threads.adoc[リアクティブメッセージングアプリケーションにおける仮想スレッド]

source: xref:./rest-virtual-threads.adoc[Virtual threads in REST applications]
ja_jp: xref:./rest-virtual-threads.adoc[REST アプリケーションにおける仮想スレッド]

source: xref:./resteasy-reactive-virtual-threads.adoc[Virtual threads in REST applications]
ja_jp: xref:./resteasy-reactive-virtual-threads.adoc[RESTアプリケーションにおける仮想スレッド]

source: xref:./scheduler-reference.adoc#virtual_threads[Execute periodic tasks on virtual threads]
ja_jp: xref:./scheduler-reference.adoc#virtual_threads[仮想スレッドでの定期的なタスクの実行]

source: xref:./virtual-threads.adoc[the virtual thread reference guide] (include native compilation and containerization)
ja_jp: xref:./virtual-threads.adoc[仮想スレッドリファレンスガイド] （ネイティブコンパイルとコンテナ化を含む）

source: xref:add-a-log-file[Add a log stream]
ja_jp: xref:add-a-log-file[ログストリームの追加]

source: xref:add-a-section-menu[Add a section menu]
ja_jp: xref:add-a-section-menu[セクションメニューの追加]

source: xref:add-full-pages[Add full custom pages]
ja_jp: xref:add-full-pages[フルカスタムページの追加]

source: xref:adding-full-pages[Full custom pages]
ja_jp: xref:adding-full-pages[フルカスタムページ]

source: xref:advanced-usage-adding-actions[Interactive pages with actions]
ja_jp: xref:advanced-usage-adding-actions[アクションを伴うインタラクティブなページ]

source: xref:amqp.adoc[Getting Started to Quarkus Messaging with AMQP]
ja_jp: xref:amqp.adoc[AMQP を使用した Quarkus Messaging 入門]

source: xref:build-items[Build items] produced by previous build steps
ja_jp: 以前のビルドステップによって生成された xref:build-items[ビルドアイテム]

source: xref:building-my-first-extension.adoc[Building your first extension]
ja_jp: xref:building-my-first-extension.adoc[最初のエクステンションの構築]

source: xref:built-in-authentication-mechanisms[Built-in authentication mechanisms]
ja_jp: xref:built-in-authentication-mechanisms[組込認証メカニズム]

source: xref:cli-tooling.adoc[CLI tooling]
ja_jp: xref:cli-tooling.adoc[CLIツール]

source: xref:compose-dev-services.adoc[Quarkus Compose Dev Services] allows you to define custom dev services using the https://compose-spec.io/[Compose specification].
ja_jp: xref:compose-dev-services.adoc[Quarkus Compose Dev Services] では、 link:https://compose-spec.io/[Compose仕様] を使用してカスタムDev Serviceを定義できます。

source: xref:config-extending-support.adoc[Extending configuration support]
ja_jp: link:config-extending-support.html[設定サポートの拡張]

source: xref:config-mappings.adoc[Mapping configuration to objects]
ja_jp: link:config-mappings.html[設定をオブジェクトにマッピング]

source: xref:config-reference.adoc#configuration-sources[Setting] `quarkus.hibernate-orm."pg".active=true` and `quarkus.datasource."pg".active=true` at runtime will make only the PostgreSQL persistence unit and datasource available, and setting `quarkus.hibernate-orm."oracle".active=true` and `quarkus.datasource."oracle".active=true` at runtime will make only the Oracle persistence unit and datasource available.
ja_jp: `quarkus.hibernate-orm."pg".active=true` と `quarkus.datasource."pg".active=true` を実行時に xref:config-reference.adoc#configuration-sources[設定] すると、 PostgreSQL の永続化ユニットとデータソースのみが利用可能になり、 `quarkus.hibernate-orm."oracle".active=true` と `quarkus.datasource."oracle".active=true` を実行時に設定すると、 Oracle の永続化ユニットとデータソースのみが利用可能になります。

source: xref:config-reference.adoc#custom-profiles[Custom configuration profiles] can help simplify such a setup. By appending the following profile-specific configuration to the one above, you can select a persistence unit/datasource at runtime simply by xref:config-reference.adoc#multiple-profiles[setting `quarkus.profile`]: `quarkus.profile=prod,pg` or `quarkus.profile=prod,oracle`.
ja_jp: xref:config-reference.adoc#custom-profiles[カスタム設定プロファイル] を使用すると、このようなセットアップを簡素化できます。 上記の設定に以下のプロファイル固有の設定を追加することで、 `quarkus.profile=prod,pg` または `quarkus.profile=prod,oracle` の xref:config-reference.adoc#multiple-profiles[`quarkus.profile` を設定]: して、 ランタイムに永続化ユニット/データソースを選択できます。

source: xref:config-reference.adoc#custom-profiles[Custom configuration profiles] simplify this setup. By appending the following profile-specific configuration to the one above, you can select a persistence unit or datasource at runtime by xref:config-reference.adoc#multiple-profiles[setting `quarkus.profile`]. For example, use `quarkus.profile=prod,pg` or `quarkus.profile=prod,oracle`.
ja_jp: xref:config-reference.adoc#custom-profiles[カスタム設定プロファイル] を使用すると、この設定が簡単になります。以下のプロファイル固有の構成を上記の構成に追加することで、 xref:config-reference.adoc#multiple-profiles[quarkus.profile ] をxref:config-reference.adoc#multiple-profiles[設定して] 、実行時に永続化ユニットまたはデータソースを選択できます。例えば、 `quarkus.profile=prod,pg` または `quarkus.profile=prod,oracle` を使用します。

source: xref:config-reference.adoc[Configuration Reference Guide]
ja_jp: xref:config-reference.adoc[設定リファレンスガイド]

source: xref:configuration[Configuration Mapping] types
ja_jp: xref:configuration[設定マッピング] の型

source: xref:cross-origin-resource-sharing[Cross-origin resource sharing]
ja_jp: xref:cross-origin-resource-sharing[クロスオリジンリソース共有]

source: xref:csrf-prevention[Cross-Site Request Forgery (CSRF) prevention]
ja_jp: xref:csrf-prevention[クロスサイト・リクエスト・フォージェリ（CSRF）対策]

source: xref:custom-cards[Create a custom card]
ja_jp: xref:custom-cards[カスタムカードの作成]

source: xref:datasource.adoc[Configure the datasource] for another tenant.
ja_jp: 別のテナントの xref:datasource.adoc[データソースを設定します]。

source: xref:datasource.adoc[Configure the datasource] for one tenant, `base`.
ja_jp: 1 つのテナント、 `base` 用に xref:datasource.adoc[データソースを設定] します。

source: xref:datasource.adoc[Configure the datasource].
ja_jp: xref:datasource.adoc[データソースを設定します]。

source: xref:declaring-a-logger-field[Declaring a logger field]
ja_jp: xref:declaring-a-logger-field[ロガー・フィールドの宣言]

source: xref:deploying-to-openshift-S2I-howto.adoc[By using a Source-to-Image (S2I) strategy]
ja_jp: xref:deploying-to-openshift-S2I-howto.adoc[Source-to-Image (S2I) ストラテジーの使用]

source: xref:deploying-to-openshift-docker-howto.adoc[By using a Docker build strategy]
ja_jp: xref:deploying-to-openshift-docker-howto.adoc[Docker build ストラテジーを使用したデプロイ]
